const questions = [
  {
    question: "भारत की राजधानी क्या है?",
    options: ["A) मुंबई", "B) नई दिल्ली", "C) कोलकाता", "D) चेन्नई"],
     correct: 1,
    answer: "✅ सही उत्तर: B) नई दिल्ली",
    explanation: "नई दिल्ली भारत की राजधानी है और यहाँ संसद भवन, राष्ट्रपति भवन और प्रमुख सरकारी कार्यालय स्थित हैं।",
    fact: "दिल्ली भारत का राष्ट्रीय राजधानी क्षेत्र है।"
  },
  {
    question: "मानव शरीर की सबसे बड़ी हड्डी कौन-सी है?",
    options: ["A) फीमर", "B) टिबिया", "C) ह्यूमरस", "D) रेडियस"],
     correct: 0,
    answer: "✅ सही उत्तर: A) फीमर",
    explanation: "फीमर जांघ की हड्डी होती है और यह शरीर की सबसे लंबी व मजबूत हड्डी मानी जाती है।",
    fact: "फीमर शरीर का वजन संभालने में बड़ी भूमिका निभाती है।"
  },
  {
    question: "कंप्यूटर का मस्तिष्क किसे कहा जाता है?",
    options: ["A) RAM", "B) CPU", "C) Monitor", "D) Keyboard"],
     correct: 1,
    answer: "✅ सही उत्तर: B) CPU",
    explanation: "CPU कंप्यूटर के सभी मुख्य calculations और processing करता है।",
    fact: "CPU का पूरा नाम Central Processing Unit है।"
  }
];